---
kind: type
id: T:Autodesk.Revit.Exceptions.CentralModelAccessDeniedException
source: html/3e38b7b1-1ee8-c7f0-6cdd-bacf67bf61f4.htm
---
# Autodesk.Revit.Exceptions.CentralModelAccessDeniedException

The exceptions thrown when a central model can be reached but
access is denied due to a lack of access privileges.

## Syntax (C#)
```csharp
[SerializableAttribute]
public class CentralModelAccessDeniedException : CentralModelException
```